Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་སྣང་བ་མཐའ་ཡས་ཀྱི་སྐུ་ལ་ནོར་བུ་རིན་པོ་ཆེ་ཨིན་དྲ་ནཱི་ལའི་ཕྱེ་མ་དང་། མར་གད་ཀྱི་ཕྱེ་མ་དང་། པད་མ་རཱ་གའི་ཕྱེ་མ་དང་། ཤེལ་གྱི་ཕྱེ་མ་དང་། གསེར་དང་དངུལ་གྱི་ཕྱེ་མ་གཏོར་བར་བགྱིའོ། །
en: To create the body of Tathāgata Amitābha, sprinkle powder made from precious sapphire powder, emerald powder, ruby powder, crystal powder, and powdered silver and gold.

source: གཡས་ཕྱོགས་སུ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ནོར་བུ་རིན་པོ་ཆེ་འཛིན་པར་བགྱིའོ།
en: “ ‘ “On his right create Bodhisattva Mahāmaṇidhara.

source: གཡོན་ཕྱོགས་སུ་ནི་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་བགྱི་སྟེ། །
en: On his left draw Ṣaḍakṣarī Mahāvidyā,

source: ཕྱག་བཞི་པ་ཁ་དོག་འདམ་བུའི་མདའ་རྒྱུ་བཞིན་དུ་དཀར་བ། །
en: who has four arms and is white like the autumn moon.

source: རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་ཕྱག་གཡོན་པར་པད་མ་བགྱིའོ།
en: She is adorned with various adornments and holds a lotus in her left hand.

source: པད་མའི་སྟེང་དུ་ནོར་བུ་བགྱིའོ།
en: Draw a jewel upon that lotus.

source: ཕྱག་གཡས་པར་སྔགས་ཀྱི་ནོར་བུ་བགྱིའོ། །
en: Draw a jewel rosary in her left hand.

source: ཕྱག་གཉིས་ཐལ་མོ་སྦྱར་བ་རྒྱལ་པོའི་དབང་པོ་ཐམས་ཅད་ཅེས་བྱ་བའི་ཕྱག་རྒྱ་བགྱིའོ། །
en: Portray the palms of two hands being placed together in the gesture named the lord-of-all-kings.

source: ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་དེའི་ཞབས་ཀྱི་འོག་ཏུ་རིག་འཛིན་བགྱི་སྟེ། །
en: “ ‘ “Draw a vidyādhara beneath the legs of Ṣaḍakṣarī Mahāvidyā.

source: ལག་པ་གཡས་པ་ན་པོག་ཕོར་ཐོགས་ཤིང་བདུག་པར་བགྱིའོ། །ལག་པ་གཡོན་པ་ན་རྒྱན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གང་བའི་སྐོན་བུ་ཐོགས་པར་བགྱིའོ། །
en: Draw him holding a smoking stick of incense in his right hand and a basket filled with various adornments in his left hand.

source: དཀྱིལ་འཁོར་དེའི་གྲྭ་བཞིར་རྒྱལ་པོ་ཆེན་པོ་བཞི་སྟེ།
en: “ ‘ “Draw the four mahārājas at the four doors of the maṇḍala.

source: ལག་ཆ་སྣ་ཚོགས་ཐོགས་པར་བགྱིའོ། །
en: Draw them holding their individual offerings.

source: དཀྱིལ་འཁོར་དེའི་གྲྭ་བཞིར་བུམ་པ་གང་བ་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་སྩལ་བ་གཞག་གོ།
en: “ ‘ “Place vases filled with various precious jewels at the four corners of the maṇḍala.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་དཀྱིལ་འཁོར་དུ་འཇུག་པར་འཚལ་ན་དེས་རུས་ཆགས་ཀྱི་རྒྱུད་ཐམས་ཅད་ཀྱི་མིང་བྲིས་ལ་ཐོག་མ་ཁོ་ནར་དཀྱིལ་འཁོར་དེར་མིང་དེ་དག་སྩལ་བར་བགྱི་སྟེ། །
en: “ ‘ “A noble son or noble daughter who wishes to enter that maṇḍala should write the names of the entire lineage of his or her family and first of all cast those names into the maṇḍala.

source: དེ་དག་ཐམས་ཅད་མིའི་སྡུག་བསྔལ་ཐམས་ཅད་སྤངས་ཤིང་
en: They will then all be freed from every human suffering

source: སྲིད་པ་ཐ་མ་པའི་བྱང་ཆུབ་སེམས་དཔར་འགྱུར་རོ།
en: and will become bodhisattvas in their last life.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མྱུར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: They will also quickly attain the highest complete enlightenment, which is complete buddhahood.

source: དེ་ལ་སློབ་དཔོན་གྱིས་གནས་མ་ལགས་པ་ལ་སྩལ་བར་མི་བགྱི་སྟེ།
en: “ ‘ “The ācārya should not give it to those who are inappropriate.

source: ཡང་ན་ནི་དད་པས་མོས་པ་ལ་སྩལ་བར་བགྱིའོ། །
en: It should be bestowed upon those who aspire for it with faith,

source: ཡང་ན་ནི་ཐེག་པ་ཆེན་པོ་ལ་དད་པས་མོས་པ་དག་ལ་སྩལ་བར་བགྱིའོ། །
en: or bestowed upon those who aspire for it with faith in the Mahāyāna.

source: མུ་སྟེགས་ཅན་ལ་སྩལ་བར་མི་བགྱིའོ།
en: It should not be given to tīrthikas.”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་བ་མཐའ་ཡས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “ ‘Then the Tathāgata, the arhat, the Samyaksaṃbuddha Amitābha said to Bodhisattva Mahāsattva Avalokiteśvara,

source: རིགས་ཀྱི་བུ་གལ་ཏེ་ནོར་བུ་རིན་པོ་ཆེ་ཨིན་དྲ་ནཱི་ལའི་ཕྱེ་མ་དང་། མ་ར་ཀ་ཏ་དང་། གསེར་དང་དངུལ་གྱི་ཕྱེ་མ་དག་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དབུལ་པོ་ལ་མེད་དོ། །
en: “Noble son, what if the noble son or noble daughter is poor and cannot use precious sapphire jewel powder, emerald powder, or gold or silver powder?”

source: བཅོམ་ལྡན་འདས་ཕྱེ་མ་དེ་དག་ཚོན་སྣ་ཚོགས་ལས་སྦྱར་ཞིང་། མེ་ཏོག་སྣ་ཚོགས་དང་། བདུག་པ་སྣ་ཚོགས་སུ་བགྱིའོ། །
en: “ ‘ “Bhagavat, he should use powder dyed with various colors and use various flowers and various incenses.”

source: རིགས་ཀྱི་བུ་གལ་ཏེ་ཡུལ་གཞན་དུ་སོང་ངམ། གནས་དང་ཐབས་ལས་བབས་པ་དག་ལ་མེད་དོ། །
en: “ ‘ “Noble son, what if, because he has gone to another land and lacks the facilities, he cannot even obtain those?”

source: དེའི་ཚེ་སློབ་དཔོན་གྱིས་ཡིད་ལ་དཀྱིལ་འཁོར་བགྱི་སྟེ། །
en: “ ‘ “Then the ācārya should imagine the maṇḍala in his mind,

source: སློབ་དཔོན་གྱིས་ཕྱག་རྒྱའི་མཚན་མ་བསྟན་པར་བགྱིའོ། །
en: and the ācārya should teach the nature of the mantras and gestures.” ’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མའི་མཆོག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: “Then the Tathāgata, the arhat, the Samyaksaṃbuddha Padmottama said to Bodhisattva Mahāsattva Avalokiteśvara,

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་རྒྱལ་མོ་ང་ལ་བྱིན་ཅིག །
en: ‘Noble son, give the six-syllable queen of mahāvidyās to me.

source: ངས་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དུ་མ་དག་དེས་འཁོར་བ་ལས་ཡོངས་སུ་ཐར་ཅིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ། །
en: I will liberate many millions of trillions of beings from saṃsāra so that they will quickly attain complete buddhahood with the highest complete enlightenment.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མའི་མཆོག་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་འདི་བྱིན་ནོ། །
en: “Then Bodhisattva Mahāsattva Avalokiteśvara gave the six-syllable queen of mahāvidyās to the Tathāgata, the arhat, the Samyaksaṃbuddha Padmottama:

source: ཨོཾ་མ་ཎི་པད་མེ་ཧཱུཾ།། །
en: “Oṁ maṇipadme hūṁ

source: གང་གི་ཚེ་ན་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདི་བྱིན་པ་དེའི་ཚེ་གླིང་བཞི་དང་ལྷའི་གནས་དང་བཅས་ཏེ། ཤིང་ཆུ་སྐྱེས་ཀྱི་འདབ་མ་བཞིན་དུ་འགུལ་ལོ།
en: “When Bodhisattva Mahāsattva Avalokiteśvara gave the six-syllable queen of mahāvidyās to the tathāgata, the arhat, the Samyaksaṃbuddha Padmottama, everywhere from the four continents to the deva realms shook like plantain leaves.

source: རྒྱ་མཚོ་མཆིང་རྣམ་བཞི་ཡང་འཁྲུགས་སོ།
en: The four great oceans shook.

source: བགེགས་དང་བར་ཆད་བྱེད་པ་ཐམས་ཅད་ཀྱང་སྐྲག་གོ། །གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ནག་པོ་ཆེན་པོ་བུད་མེད་མང་པོ་དང་བཅས་པ་ཡང་བྲོས་སོ། །
en: All vighnas and vināyakas, yakṣas and rākṣasas, together with the companies of mahākālas, and mātṛs, fled.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་པད་མའི་མཆོག་གིས་བལ་གླང་གི་སྣ་དང་འདྲ་བའི་དཔུང་པ་ཕྱུང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་མུ་ཏིག་གི་སེ་མོ་དོ་རིན་བརྒྱ་སྟོང་རི་བ་ཕུལ་ལོ། །
en: “Tathāgata Padmottama extended his arm like an elephant extending its trunk and offered a hundred thousand precious strings of pearls to Bodhisattva Mahāsattva Avalokiteśvara,

source: དེས་ཀྱང་བླངས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་བ་མཐའ་ཡས་ལ་ཕུལ་ལོ།
en: who accepted them and offered them to the Tathāgata, the arhat, the Samyaksaṃbuddha Amitābha,

source: དེས་ཀྱང་བླངས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མའི་མཆོག་ལ་ཕུལ་ལོ། །
en: who then offered them back to the Tathāgata, the arhat, the Samyaksaṃbuddha Padmottama.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མའི་མཆོག་གིས་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདི་བླངས་ནས་འཇིག་རྟེན་གྱི་ཁམས་པད་མ་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: “Then the Tathāgata, the arhat, the Samyaksaṃbuddha Padmottama, having received the six-syllable queen of mahāvidyās, went to the realm named Padmottama.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ངས་སྔོན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མའི་མཆོག་ལས་ཐོས་སོ། །
en: “Noble son, in the past, that is what I heard from the Tathāgata, the arhat, the Samyaksaṃbuddha Padmottama.”

source: བཅོམ་ལྡན་འདས་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་རྣལ་འབྱོར་སྤྱོད་པ་བདག་གིས་ཇི་ལྟར་ཐོབ་པར་བགྱི། །
en: “Bhagavat, how can I obtain the six-syllable mahāvidyā of perfect yoga?

source: བཅོམ་ལྡན་འདས་དཔེར་ན་བདུད་རྩི་ཐོབ་ན་རོ་མྱོང་བས་ཆོག་མ་འཚལ་བ་དེ་བཞིན་དུ།
en: Bhagavat, just like those who are not satisfied by just a taste of amṛta,

source: བཅོམ་ལྡན་འདས་དཔེར་ན་བདུད་རྩི་ཐོབ་ན་རོ་མྱོང་བས་ཆོག་མ་འཚལ་བ་དེ་བཞིན་དུ། །
en: Bhagavat, just like those who are not satisfied by just a taste of amṛta,

source: བཅོམ་ལྡན་འདས་བདག་ཀྱང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ཐོས་པ་ཙམ་གྱིས་ཆོག་མ་འཚལ་ཏོ།
en: Bhagavat, I am not satisfied by simply hearing about the six-syllable mahāvidyā.

source: སེམས་ཅན་གང་དག་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདི་འཛབ་ཏུ་བགྱིད་པ་དང་། ཉན་པ་དང་། སེམས་པ་དང་། བསམ་པ་ལྷག་པས་འཛིན་པ་དེ་དག་ནི་བསོད་ནམས་དང་ལྡན་པ་ལགས་སོ།
en: Meritorious are those beings who, with higher motivation, possess this six-syllable mahāvidyā and repeat, listen to, and contemplate it.”

source: རིགས་ཀྱི་བུ་གང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདི་འདྲིར་འཇུག་པ་དེས་ནི་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་འདྲིར་འཇུག་པར་འགྱུར་རོ།
en: “Noble son, those who write out this six-syllable mahāvidyā are writing out the collection of eighty-four thousand Dharmas.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྡུལ་ཕྲ་རབ་དང་མཉམ་པ་ལྷའི་གསེར་རིན་པོ་ཆེ་ལས་བྱེད་ཅིང་བྱས་ནས་ཉིན་གཅིག་བཞིན་དུ་རིང་བསྲེལ་འཇུག་པ་དེའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ནི་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་ཡི་གེ་འབྲུ་གཅིག་གི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཙམ་སྟེ། ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་བོ། །ཐར་པར་ཤིན་ཏུ་གནས་པའོ། །
en: If stūpas were made from precious divine gold for tathāgatas, arhats, and samyaksaṃbuddhas equal in number to atoms, and if in one day they were all filled with their relics, the result ripening from that would only equal the result that ripens from one syllable of the six-syllable mahāvidyā, which has inconceivable qualities and brings liberation.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདི་ཟློས་པར་བྱེད་པ་དེ་ནི་ཏིང་ངེ་འཛིན་འདི་དག་ཐོབ་པར་འགྱུར་རོ།
en: “The noble son or noble daughter who repeats this six-syllable mahāvidyā will attain these samādhis:

source: ནོར་བུ་རིན་པོ་ཆེ་འཛིན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Jewel Holder,

source: སེམས་ཅན་དམྱལ་བ་དང་བྱོལ་སོང་སྐེམས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Purification of Hells and Animals,

source: རྐང་པ་ཤིན་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Stable Conduct,

source: ཐབས་མཁས་པ་ཐམས་ཅད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Skillfulness in All Methods,

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྟོན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Revealing All Buddha Realms,

source: ཆོས་ཐམས་ཅད་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Entering All Dharmas,

source: བསམ་གཏན་གྱི་རྒྱན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Adornment of Dhyāna,

source: ཆོས་ཀྱི་ཤིང་རྟ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Entering the Chariot of the Dharma,

source: འདོད་ཆགས་དང་ཞེ་སྡང་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Complete Liberation from Desire and Anger,

source: མཐའ་ཡས་བེའུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Eternal Calf,

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་འཆང་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Teaching the Six Perfections,

source: རི་རབ་ཆེན་པོ་འཛིན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Holding Great Meru,

source: སེམས་ཅན་སྲིད་པ་ལས་སྒྲོལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Rescuing from All Existences,

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་གཟིགས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Seeing All the Tathāgatas,

source: གནས་ཤིན་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་རྣམས་ཏེ།
en: and the samādhi named Complete Stability.

source: རིགས་ཀྱི་བུ་གང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་རྒྱལ་མོ་འཛིན་པ་ནི་དེ་ལྟ་བུ་ལ་སོགས་ཏེ་ཏིང་ངེ་འཛིན་བརྒྱ་རྩ་བརྒྱད་ཐོབ་པར་འགྱུར་རོ། །
en: “Noble son, it is like this: those who possess the six-syllable queen of mahāvidyās will attain one hundred and eight samādhis.”

source: བཅོམ་ལྡན་འདས་བདག་གང་དུ་མཆི་བར་བགྱི། ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་གང་དུ་འཐོབ་པར་འགྱུར། །
en: “Bhagavat, where can I go to obtain this mahāvidyā?”

source: རིགས་ཀྱི་བུ་ཡུལ་ཁོར་མོར་འཇིག་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ན་གང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འཛིན་པར་བྱེད། ཀློག་པར་བྱེད། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པའི་ཆོས་སྨྲ་བ་ཡོད་དོ། །
en: “Noble son, in the great city of Vārāṇasī there is a dharmabhāṇaka who possesses, recites, and is completely focused on the six-syllable mahāvidyā.”

source: བཅོམ་ལྡན་འདས་ཡུལ་ཁོར་མོར་འཇིག་གི་གྲོང་ཁྱེར་ཆེན་པོར་ཆོས་སྨྲ་བ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་། བསྙེན་བཀུར་བགྱི་བའི་སླད་དུ་བདག་མཆིའོ། །
en: “Bhagavat, I will go to the great city of Vārāṇasī in order to see that dharmabhāṇaka, to bow down to him, and to honor him.”

source: ལེགས་སོ། །ལེགས་སོ། །
en: excellent! Excellent!”

source: རིགས་ཀྱི་བུ་དེ་ལྟར་གྱིས་ཤིག །
en: Do so, noble son!

source: གང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདི་འཛིན་པའི་ཆོས་སྨྲ་བ་དེ་དག་ནི་དཀོན་པའོ།
en: A dharmabhāṇaka who possesses, recites, and is completely focused on the six-syllable mahāvidyā is rare.

source: ཆོས་སྨྲ་བ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་དང་མཉམ་པར་བལྟ་བར་བྱའོ། །འགྲོ་བའི་བསོད་ནམས་ཀྱི་འགྲམ་དང་འདྲ་བར་བལྟ་བར་བྱའོ། །
en: He should be seen as being equal to the tathāgatas; seen as being the life of the world;

source: ཕུང་པོ་བཞིན་དུ་བལྟ་བར་བྱའོ། །
en: seen as a mass of merit;

source: ཕྱིན་ཅི་མ་ལོག་པར་གསུང་བ་བཞིན་དུ་བལྟ་བར་བྱའོ།
en: seen as one who speaks the truth;

source: རིན་པོ་ཆེའི་ཕུང་པོ་བཞིན་དུ་བལྟ་བར་བྱའོ། །
en: seen as a heap of jewels;

source: དམ་པ་སྦྱིན་པར་བྱེད་པའི་ཡིད་བཞིན་གྱི་ནོར་བུ་བཞིན་དུ་བལྟ་བར་བྱའོ། །
en: seen as a wish-fulfilling jewel;

source: ཆོས་ཀྱི་མཛོད་བཞིན་དུ་བལྟ་བར་བྱའོ། །འགྲོ་བ་སྒྲོལ་བར་བྱེད་པ་བཞིན་དུ་བལྟ་བར་བྱའོ། །
en: seen as a Dharma king; and seen as a savior of beings.

source: རིགས་ཀྱི་བུ་ཆོས་སྨྲ་བ་དེའི་བྱེད་པ་མཐོང་ནས་ཐེ་ཙོམ་མི་སྐྱེ་བར་བྱའོ། །
en: “Noble son, you should have no doubts when you see this dharmabhāṇaka.

source: རིགས་ཀྱི་བུ་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའི་ས་ནས་འཕོས་ཤིང་ངན་སོང་དུ་སྐྱེས་ས་རེ། །
en: Noble son, do not fall from a bodhisattva bhūmi to be reborn in the lower existences.

source: ཆོས་སྨྲ་བ་དེ་ནི་ཚུལ་ཁྲིམས་ཉམས་པ། །
en: This dharmabhāṇaka’s conduct is poor,

source: སྤྱོད་པ་ཉམས་པ།
en: and his behavior is poor.

source: ཆུང་མ་དང་། བུ་དང་། བུ་མོས་ཡོངས་སུ་བསྐོར་བ།
en: He is surrounded by his wife, sons, and daughters.

source: ངུར་སྨྲིག་ཀྱང་བཤང་བ་དང་གཅི་བས་ཡོངས་སུ་གང་བ།
en: His orange robes are filled with feces and urine;

source: སྤྱོད་ལམ་མ་བསྡམས་པ་ཡིན་ནོ།
en: he has not followed the noble path.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་བཞིན་དུ་འཚལ་ལོ། །
en: “I will do as the Bhagavat has instructed.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་དང་། རབ་ཏུ་བྱུང་བ་དང་། ཁྱེའུ་དང་། བུ་མོ་བརྒྱ་ཕྲག་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཏེ་སོང་ནས་
en: So Bodhisattva Mahāsattva Sarva­nīvaraṇa­viṣkambhin set forth accompanied by many hundreds of thousands of lay bodhisattvas, monastics, boys, and girls.

source: ཆོས་སྨྲ་བ་དེ་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་ལྷའི་གདུགས་དང་།
en: In order to make offerings to the dharmabhāṇaka, they brought divine parasols,

source: ལྷའི་ལྷམ་དང་། ཅོད་པན་དང་། རྣ་ཆ་དང་། ཕྲེང་བའི་ཆུན་པོ་དང་། དཔུང་རྒྱན་དང་། སེ་མོ་དོ་དང་། སེ་མོ་དོ་ཕྱེད་པ་ཕྲག་པ་ནས་འཕྱང་བ་དང་། སྙན་གྱི་གོང་རྒྱན་དང་། སོར་གདུབ་ཀྱི་རྣམ་པ་དང་། གཞན་ཡང་གོས་རྣམ་པ་སྣ་ཚོགས་པ་རྒྱའི་ཡུལ་ནས་བྱུང་བ་དང་། རིག་འཛིན་གྱིས་བསྐུལ་བ་དང་། ཡུལ་ཀ་ཤི་ཀ་ནས་བྱུང་བའི་གོས་དང་། མས་བགྲུ་བའི་གོས་དང་།
en: divine shoes, diadems, earrings, garlands, armlets, one hundred and eight-string and sixty-four-string necklaces for covering the shoulders, ear adornments, and finger rings; and also various kinds of clothing: monastic robes, clothing commanded by the vidyādharas, and Kaśika cloth;

source: སེ་མོ་དོ་དང་། སེ་མོ་དོ་ཕྱེད་པ་ཕྲག་པ་ནས་འཕྱང་བ་དང་།
en: one hundred and eight-string and sixty-four-string necklaces for covering the shoulders,

source: སྙན་གྱི་གོང་རྒྱན་དང་།
en: ear adornments,

source: སོར་གདུབ་ཀྱི་རྣམ་པ་དང་།
en: and finger rings;

source: གཞན་ཡང་གོས་རྣམ་པ་སྣ་ཚོགས་པ་རྒྱའི་ཡུལ་ནས་བྱུང་བ་དང་། རིག་འཛིན་གྱིས་བསྐུལ་བ་དང་། ཡུལ་ཀ་ཤི་ཀ་ནས་བྱུང་བའི་གོས་དང་། མས་བགྲུ་བའི་གོས་དང་།
en: and also various kinds of clothing: monastic robes, clothing commanded by the vidyādharas, and Kaśika cloth;

source: གཞན་ཡང་མེ་ཏོག་སྣ་ཚོགས་པ་འདི་ལྟ་སྟེ།
en: and also various flowers:

source: མེ་ཏོག་ཨུད་པལ་དང་། ཀུ་མུ་ད་དང་། པུན་ད་རཱི་ཀ་དང་། མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། མན་ཛུ་ཥ་ཀ་དང་། མན་ཛུ་ཥ་ཀ་ཆེན་པོ་དང་། ཨུ་དུམ་བ་ར་དང་། །
en: blue lotuses, red lotuses, night lotuses, white lotuses, tiger claw flowers and great tiger claw flowers, mañjuṣukas and mahāmañjuṣukas, udumbaras,

source: གཞན་ཡང་ཤིང་གི་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་པ་ཙམ་པ་ཀ་དང་།
en: various kinds of turmeric flowers,

source: ཀ་ར་བཱི་ར་དང་། བད་ཏ་ལ་དང་། ཨ་ཏི་མུཀྟ་དང་། བཱ་ར་ཤི་ཀཱ་དང་། ཀུན་ད་དྷྱ་ཥི་ཏ་དང་། སུ་མ་ན་དང་། བི་མཱ་ན་ཀ་ལ་སོགས་པ་དང་།
en: magnolias, oleanders, trumpet flowers, mountain ebony, gardenia, star jasmine, night-flowering jasmine, and so on;

source: འདབ་མ་བརྒྱ་པ་ངུར་པས་མཛེས་པར་བྱས་པ། བྱ་ཤ་རི་ཀ་དག་མོས་པར་བྱས་པ།
en: beautiful peacocks, brahminy ducks, and delightful mynas;

source: སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ཤེལ་གྱི་ཁ་དོག་དང་།
en: the colors blue, yellow, red, white, and crystal;

source: གཞན་ཡང་འབྲས་བུ་དང་། མེ་ཏོག་གི་རྣམ་པ་སྣ་ཚོགས་དག་
en: and also various fruits and flowers.

source: ཡུལ་ཁོར་མོར་འཇིག་གི་གྲོང་ཁྱེར་ཆེན་པོ་ག་ལ་བ་དེར་སོང་སྟེ། མཐར་གྱིས་ཁོར་མོར་འཇིག་གི་གྲོང་ཁྱེར་ཆེན་པོར་ཕྱིན་པ་དང་།
en: He went to the great city of Vārāṇasī and eventually arrived there.

source: ཆོས་སྨྲ་བ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། །
en: He went to where the dharmabhāṇaka was and bowed his head to his feet.

source: དེས་དེ་ཚུལ་ཁྲིམས་ཉམས་པ། སྤྱོད་པ་ཉམས་པ། སྤྱོད་ལམ་མ་བསྡམས་པ་མཐོང་ནས་
en: Sarva­nīvaraṇa­viṣkambhin saw someone whose conduct was poor, whose behavior was poor, and whose path was imperfect.

source: གདུགས་དང་། ལྷམ་དེ་དག་དང་། གོས་དང་། རྒྱན་དང་། དྲི་དང་། བྱུག་པ་དག་གིས་མཆོད་པ་ཆེན་པོ་བྱས་ནས་ཆོས་སྨྲ་བ་དེའི་མདུན་དུ་ཐལ་མོ་སྦྱར་ཏེ། །
en: Sarva­nīvaraṇa­viṣkambhin gave him a great offering of parasols, shoes, cloth, adornments, scents, and ointments, and placing his palms together in front of the dharmabhāṇaka,

source: ཀྱེ་མའོ་ཆོས་ཀྱི་གཏེར་མྱོང་བར་མཛད་པ།
en: “O you who are the treasurer of the Dharma,

source: བདུད་རྩིའི་གཏེར་བསགས་པ་ལྟ་བུ་རྒྱ་མཚོ་དང་མཉམ་པ་ཁྱོད་ལ་དཔག་མི་ནུས་སོ། །
en: you are like an unfathomable ocean that is an accumulation of the treasure of amṛta.

source: མིར་གྱུར་པ་ཐམས་ཅད་ཀྱི་སྣོད་དུ་གྱུར་པའོ། །
en: You are a repository within the human realm.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་དག་ཁྱོད་ལས་ཆོས་ཉན་ཏེ། ཁྱོད་ལ་ཆོས་ཉན་པའི་ཚེ་ཐམས་ཅད་འདུ་བར་བགྱིད་དོ།
en: The devas, nāgas, yakṣas, asuras, garuḍas, kiṃnaras, mahoragas, humans, and nonhumans gather to listen to the Dharma from you.

source: ཁྱོད་ནི་རྡོ་རྗེ་ཆེན་པོ་དང་མཉམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འཆད་པར་མཛད་དོ། །
en: “You teach a Dharma that is like a great vajra.

source: སེམས་ཅན་འཁོར་བའི་བཅིང་བས་བཅིངས་པ་མང་པོ་དག་ཡོངས་སུ་ཐར་བར་མཛད་དོ། །
en: You liberate many beings who are bound in the bondage of saṃsāra.

source: སེམས་ཅན་གང་ཁོར་མོར་འཇིག་གི་གྲོང་ཁྱེར་ཆེན་པོ་ན་གནས་ཤིང་རྟག་ཏུ་ཡོངས་སུ་སྡུད་པར་མཐོང་བ་དེ་དག་ནི་བསོད་ནམས་དང་ལྡན་པ་ལགས་སོ། །
en: Meritorious are those beings who live in Vārāṇasī, can see you, and always gather around you.

source: དེ་མཐོང་མ་ཐག་ཏུ་སྡིག་པ་ཐམས་ཅད་འཕྲོག་པར་མཛད་པ།
en: The instant they see you, you burn up all their bad karma.

source: དཔེར་ན་མེས་ནགས་ཀྱི་འདབ་མ་མྱུར་དུ་འཚིག་པར་བགྱིད་པ་དེ་བཞིན་དུ་ཁྱོད་མཐོང་མ་ཐག་ཏུ་སྡིག་པ་ཐམས་ཅད་འཕྲོག་པར་མཛད་དོ། །
en: You burn up all bad karma like a fire burns a forest, just through being seen.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་མཁྱེན་ཏོ། །
en: The tathāgatas, arhats, and samyaksaṃbuddhas know of you.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། ཚངས་པ་དང་། འཇུག་སྲེད་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། རླུང་གི་ལྷ་དང་། ཆུའི་ལྷ་དང་། མེའི་ལྷ་དང་། ཆོས་ཀྱི་རྒྱལ་པོ་གཤིན་རྗེ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དག་ཀྱང་ཁྱོད་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་མཆིའོ། །
en: Many millions of trillions of bodhisattvas come to make offerings to you, as do Brahmā, Viṣṇu, Maheśvara, Āditya, Candra, Vāyu, Varuṇa, Agni, Dharmarāja Yama, and the four mahārājas.”

source: དེ་ནས་ཆོས་སྨྲ་བ་དེས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The dharmabhāṇaka said to him,

source: རིགས་ཀྱི་བུ་ཁྱོད་འགྱོད་པ་མ་སྐྱེད་ཅིག
en: “Noble son, do not create a cause for remorse.

source: གྲོགས་པོ་ཉོན་མོངས་པ་ནི་ཆགས་པའོ། །སྤྱད་པའོ། །འཁོར་བའི་མཚན་མའོ། །སྐྱེ་དགུའི་འཁོར་ལོ་སྐྱེད་པར་བྱེད་པའོ། །
en: Those who indulge in the afflictions create the realms of beings and have the characteristics of saṃsāra.

source: གང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ཤེས་པ་དེ་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས་མི་གོས་ཏེ། །
en: “Those who know the six-syllable mahāvidyā will not be polluted by desire, anger, or stupidity.

source: དཔེར་ན་འཇམ་བུའི་ཆུ་བོའི་གསེར་དྲི་མས་མི་གོས་པ་དེ་བཞིན་དུ་རིགས་ཀྱི་བུ་གང་གི་ལུས་ལ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་ཐོགས་པ་དེའི་ལུས་ལ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས་མི་གོས་སོ།
en: Noble son, just as the gold in the Jambu River does not become stained, someone who wears the six-syllable queen of mahāvidyās on his body will have a body that is not polluted by desire, anger, or stupidity.”

source: དེ་ནས་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་རྐང་པ་ལ་དམ་དུ་བཟུང་སྟེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Sarva­nīvaraṇa­viṣkambhin grasped the dharmabhāṇaka’s feet tightly and said,

source: དབང་པོ་ཉམས་པའི་མིག་ཏུ་གྱུར་ཅིག །
en: “My senses are impaired, so be my eyes!

source: ལམ་སྟོར་བ་ལ་ལམ་སྟོན་པར་མཛོད་ཅིག །
en: I have lost the path, so show me the path!

source: བདག་ཆོས་ཀྱིས་སྐོམ་པ་ལ་ཆོས་ཀྱི་རོས་ངོམས་པར་མཛོད་ཅིག །
en: I am thirsty for the Dharma, so quench my thirst with the taste of the Dharma!

source: བདག་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ས་བོན་སྩོལ་ཅིག །
en: I lack the highest complete enlightenment, so give me the seed for enlightenment!

source: ཆོས་ཀྱི་སྐབས་དང་། ཤིན་ཏུ་གནས་པའི་ཚུལ་གྱི་གནས་ཡོངས་སུ་དག་པ་སྩོལ་ཅིག །མི་ཕྱེད་པའི་དགེ་བ་ཐོབ་པའི་ཞེས་འགྲོ་བ་ཐམས་ཅད་མཆིའོ། །
en: Give me the opportunity of the Dharma! Give me the pure body of perfectly established forms! Give me a good reputation so that all beings say, ‘He has gained unwavering goodness!’

source: ཚིག་སྙན་པ་བླ་མས་བདག་ལ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་སྩོལ་ཅིག
en: Thus, guru, give me the six-syllable queen of mahāvidyās,

source: དེས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མྱུར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱིའོ། །
en: through which I will quickly achieve the highest complete enlightenment and be a samyaksaṃbuddha!

source: ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་བཅུ་གཉིས་བསྐོར་བར་བགྱིའོ། །
en: Turn the twelve wheels of the Dharma!

source: སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བགྱིའོ། །
en: Free all beings from the suffering of saṃsāra!

source: ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་རྒྱལ་མོ་བདག་ལ་སྩོལ་ཅིག
en: Give me the six-syllable queen of mahāvidyās

source: མགོན་དང་། སྐྱབས་དང་། རྟེན་དུ་གྱུར་ཅིག །
en: Be my protector, refuge, and support.

source: གནས་མ་མཆིས་པ་རྣམས་ཀྱི་གནས་སུ་གྱུར་ཅིག །
en: Be a home for the homeless.”

source: ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་རྒྱལ་མོ་ནི་དཀོན་པའི་ཚིག་སྟེ། །
en: “The six-syllable queen of mahāvidyās is a recitation that is hard to find.

source: འདི་ནི་རྡོ་རྗེ་མི་ཕྱེད་པའི་ཚིག་གོ། །
en: It is an unbreakable vajra recitation.

source: བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་ཚིག་གོ། །
en: It is a recitation of the highest wisdom.

source: མི་ཟད་པའི་ཡེ་ཤེས་ཀྱི་ཚིག་གོ། །
en: It is a recitation of unceasing wisdom.

source: ལྟག་ན་མེད་པའི་ཚིག་གོ། །
en: It is an unsurpassable recitation.

source: ཐར་པར་འཇུག་པར་བྱེད་པའི་ཚིག་གོ། །
en: It is a recitation that brings liberation.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་རྣམ་པར་དག་པའི་ཚིག་གོ། །
en: It is a recitation of the pure wisdom of the tathāgatas.

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། འཁོར་བའི་སྡུག་བསྔལ་ཡོངས་སུ་སྤོང་བའི་ཚིག་གོ། །
en: It is a recitation that eliminates desire, anger, stupidity, and the sufferings of saṃsāra.

source: ཐབས་མཁས་པ་ཐམས་ཅད་ཀྱི་ཚིག་གོ།
en: It is a recitation of skill in all methods.
